{
    "status": "ok",
    "totalResults": 38,
    "articles": [
        {
            "source": {
                "id": "the-washington-post",
                "name": "The Washington Post"
            },
            "author": "Bryan Pietsch, Niha Masih, Lyric Li, Annabelle Timsit",
            "title": "Russia-Ukraine war live updates: Wagner Group turns back from march on Moscow - The Washington Post",
            "description": "Yevgeniy Prigozhin, the head of the mercenary group, halted his fighters’ approach on Moscow after a day of rising tensions in Russia. Follow for live updates.",
            "url": "https://www.washingtonpost.com/world/2023/06/25/russia-ukraine-war-wagner-putin-live-updates/",
            "urlToImage": "https://www.washingtonpost.com/wp-apps/imrs.php?src=https://d1i4t8bqe7zgj6.cloudfront.net/06-25-2023/t_31a7d7e314cd474aadeb77e7207f610d_name_VAKQTHWOISTKLW7EBAQW5OAEYQ.jpg&w=1440",
            "publishedAt": "2023-06-25T08:37:30Z",
            "content": "The leader of the Wagner mercenary group, Yevgeniy Prigozhin, is expected to go to Belarus under a deal brokered by the Belarusian president, putting an end to a shocking, albeit short-lived, challen… [+235 chars]"
        },
        {
            "source": {
                "id": "abc-news",
                "name": "ABC News"
            },
            "author": "MATTHEW BROWN and GENE JOHNSON Associated Press",
            "title": "Freight train carrying hot asphalt, molten sulfur plunges into Yellowstone River as bridge fails - ABC News",
            "description": "A bridge that crosses the Yellowstone River in Montana collapsed, plunging a freight train carrying hot asphalt and molten sulfur into the rushing water below",
            "url": "https://abcnews.go.com/US/wireStory/bridge-yellowstone-river-collapses-sending-freight-train-waters-100356663",
            "urlToImage": "https://s.abcnews.com/images/US/wirestory_dbd905bac1b35a63107213db7983bafc_16x9_992.jpg",
            "publishedAt": "2023-06-25T08:36:27Z",
            "content": "COLUMBUS, Mont. -- A bridge that crosses the Yellowstone River in Montana collapsed early Saturday, plunging portions of a freight train carrying hazardous materials into the rushing water below.\r\nTh… [+4087 chars]"
        },
        {
            "source": {
                "id": null,
                "name": "Fox Business"
            },
            "author": "Ken Martin",
            "title": "States weigh charging by the mile as fuel taxes plummet - Fox Business",
            "description": "States are experimenting with charging drivers by the mile instead of relying on declining gas tax revenue as electric vehicle sales rise.",
            "url": "https://www.foxbusiness.com/politics/states-weigh-charging-by-the-mile-as-fuel-taxes-plummet",
            "urlToImage": "https://a57.foxnews.com/static.foxbusiness.com/foxbusiness.com/content/uploads/2023/06/0/0/Measuring-Mileage-A.jpg?ve=1&tl=1",
            "publishedAt": "2023-06-25T08:33:15Z",
            "content": "States are looking for ways to keep the funds coming in order to maintain the nation's roads.\r\nGas taxes have been used for more than a century for the purpose.\r\nThe problem that has developed is tho… [+2744 chars]"
        },
        {
            "source": {
                "id": null,
                "name": "MLB.com"
            },
            "author": "Bryan Hoch",
            "title": "Judge has torn ligament in toe; still no timeline for return - MLB.com",
            "description": "NEW YORK -- For the first time, Aaron Judge has referred to his right big toe injury as a torn ligament, further clouding a potential return date for the American League’s reigning Most Valuable Player.\nJudge has been out of the Yankees’ lineup since June 3, …",
            "url": "https://www.mlb.com/news/aaron-judge-torn-ligament-in-toe-no-timeline-for-return",
            "urlToImage": "https://img.mlbstatic.com/mlb-images/image/upload/t_2x1/t_w1536/mlb/rpa46kyfdapyxz2hd8ba.jpg",
            "publishedAt": "2023-06-25T08:09:24Z",
            "content": "NEW YORK -- For the first time, Aaron Judge has referred to his right big toe injury as a torn ligament, further clouding a potential return date for the American Leagues reigning Most Valuable Playe… [+4310 chars]"
        },
        {
            "source": {
                "id": "cnn",
                "name": "CNN"
            },
            "author": "Nouran Salahieh,Samantha Beech",
            "title": "Voice recordings and data from the mother ship that carried the Titan submersible before it imploded will be examined, investigators say - CNN",
            "description": "As a remotely operated robot maps out the debris field from the fatal Titan submersible implosion, investigators will be reviewing voice recordings from the mother ship that carried the vessel and its five occupants on its journey to the site of the Titanic w…",
            "url": "https://www.cnn.com/2023/06/25/americas/submersible-titanic-implosion-deaths-sunday/index.html",
            "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/230623140102-01a-oceangate-investigation-restricted.jpg?c=16x9&q=w_800,c_fill",
            "publishedAt": "2023-06-25T05:49:00Z",
            "content": "As a remotely operated robot maps out the debris field from the fatal Titan submersible implosion, investigators will be reviewing voice recordings from the mother ship that carried the vessel and it… [+5470 chars]"
        },
        {
            "source": {
                "id": null,
                "name": "Bleeding Cool News"
            },
            "author": "Gavin Sheehan",
            "title": "Valorant Reveals Everything Left To Show Off For Episode 7 - Bleeding Cool News",
            "description": "Riot Games took time over the weekend to release new information for Episode 7 of Valorant, as some new info dropped about their latest agent. The team gave more info on how Deadlock will play, as they seem to be a little more well-rounded with some keen spec…",
            "url": "https://bleedingcool.com/games/valorant-reveals-everything-left-show-off-episode-7-2/",
            "urlToImage": "https://bleedingcool.com/wp-content/uploads/2023/06/Valorant-Deadlock-Agent-Wallpaper-1200x628.jpg",
            "publishedAt": "2023-06-25T04:32:09Z",
            "content": "Posted in: Games, Riot Games, Valorant, Video Games | Tagged: Riot Games, Valorant\r\nRiot Games released new details today about Episode 7 of Valorant, including new info on the battle pass and the la… [+2802 chars]"
        },
        {
            "source": {
                "id": null,
                "name": "KOAT New Mexico"
            },
            "author": "Sam Smith",
            "title": "One person dies in shooting incident involving Albuquerque Police - KOAT New Mexico",
            "description": "No officers were injured in the shooting",
            "url": "https://www.koat.com/article/one-person-wounded-in-shooting-incident-involving-albuquerque-police/44329154",
            "urlToImage": "https://kubrick.htvapps.com/htv-prod-media.s3.amazonaws.com/images/ois-3-64976f5bcd47a.jpg?crop=1.00xw:0.754xh;0,0.0848xh&resize=1200:*",
            "publishedAt": "2023-06-25T04:10:00Z",
            "content": "ALBUQUERQUE, N.M. —One person has died after a shooting incident involving police in northwest Albuquerque.\r\nA spokesman for APD says the shooting took place in the vicinity of El Mezquite Market, ne… [+657 chars]"
        },
        {
            "source": {
                "id": "cnn",
                "name": "CNN"
            },
            "author": "Jessie Yeung",
            "title": "Moscow has stepped back from civil war with Wagner. But the danger’s not over, experts warn - CNN",
            "description": "Within a remarkable day and a half, Russia faced the very real threat of an armed insurrection, with President Vladimir Putin vowing to punish Wagner fighters marching toward Moscow and occupying cities along the way – before a sudden deal with Belarus seemed…",
            "url": "https://www.cnn.com/2023/06/25/europe/russia-prigozhin-wagner-insurrection-belarus-explainer-intl-hnk/index.html",
            "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/230624181456-18-russia-rostov-0624.jpg?c=16x9&q=w_800,c_fill",
            "publishedAt": "2023-06-25T04:08:00Z",
            "content": "Within a remarkable day and a half, Russia faced the very realthreat of an armed insurrection, with President Vladimir Putin vowing to punish Wagner fighters marching toward Moscow and occupying citi… [+7758 chars]"
        },
        {
            "source": {
                "id": null,
                "name": "WESH Orlando"
            },
            "author": "Chelsea Robinson",
            "title": "Tropical Storm Cindy continues moving northwest - WESH 2 Orlando",
            "description": "According to the National Hurricane Center, Cindy is now moving into a environment with conditions that are less favorable for further development.",
            "url": "https://www.wesh.com/article/tropical-storm-cindy-path-track/44325207",
            "urlToImage": "https://kubrick.htvapps.com/htv-prod-media.s3.amazonaws.com/images/cindy-11pm-6497a8997ff4b.jfif?crop=1.00xw:1.00xh;0,0&resize=1200:*",
            "publishedAt": "2023-06-25T03:44:00Z",
            "content": "ORLANDO, Fla. —On Saturday night, Tropical Storm Cindy had continued moving northwestward.\r\nAccording to the National Hurricane Center, Cindy is now moving into a environment with conditions that are… [+1901 chars]"
        },
        {
            "source": {
                "id": null,
                "name": "Deadline"
            },
            "author": "Tom Tapp",
            "title": "Julian Sands Search: Hikers Find Human Remains In Area Where Actor Disappeared - Deadline",
            "description": "The San Bernardino Sheriff’s office announced today that hikers had found a body in the Mount Baldy wilderness, the same general vicinity where actor Julian Sands disappeared in January. The …",
            "url": "https://deadline.com/2023/06/julian-sands-hikers-find-body-1235423989/",
            "urlToImage": "https://deadline.com/wp-content/uploads/2023/06/Julian-Sands.jpg?w=1000",
            "publishedAt": "2023-06-25T03:12:00Z",
            "content": "The San Bernardino Sheriff’s office announced today that hikers had found a body in the Mount Baldy wilderness, the same general vicinity where actor Julian Sands disappeared in January. The announce… [+2012 chars]"
        },
        {
            "source": {
                "id": null,
                "name": "San Francisco Chronicle"
            },
            "author": "Chronicle Staff",
            "title": "SF Dyke March draws thousands in powerful, proud showing of solidarity - San Francisco Chronicle",
            "description": "SF Dyke March draws thousands in powerful, proud showing of solidarity through Castro, Mission districts.",
            "url": "https://www.sfchronicle.com/bayarea/article/sf-dyke-march-18166163.php",
            "urlToImage": "https://s.hdnux.com/photos/01/33/34/43/23972069/6/rawImage.jpg",
            "publishedAt": "2023-06-25T02:48:21Z",
            "content": "Thousands of women paraded proudly and passionately through San Franciscos Mission and Castro districts Saturday evening during the Dyke March, a joyful celebration of community. The march was led by… [+1230 chars]"
        },
        {
            "source": {
                "id": null,
                "name": "Daily Advertiser"
            },
            "author": "Koki Riley",
            "title": "LSU baseball beats Florida in Game 1 of College World Series final on Cade Beloso home run - Daily Advertiser",
            "description": "Cade Beloso's 11th inning home run delivers LSU baseball a win in Game 1 of the 2023 College World Series final over Florida.",
            "url": "https://www.theadvertiser.com/story/sports/college/lsu/2023/06/24/lsu-baseball-cade-beloso-florida-college-world-series-2023/70331551007/",
            "urlToImage": "https://www.theadvertiser.com/gcdn/presto/2023/06/25/PLAL/94bf1dbc-b99e-4cc2-bf1b-e6a9ba35f23c-USATSI_20945097.jpg?crop=3650,2054,x0,y0&width=3200&height=1801&format=pjpg&auto=webp",
            "publishedAt": "2023-06-25T02:41:09Z",
            "content": "OMAHA, Neb. After tearing his ACL and meniscus on Opening Day last season, Cade Beloso came back to LSU baseball for one more chance.\r\nOne more chance to hear the roar of the LSU crowd. One more chan… [+2814 chars]"
        },
        {
            "source": {
                "id": null,
                "name": "WCPO"
            },
            "author": "Brandon Spinner",
            "title": "What you need to know about Sunday's severe weather threat - WCPO 9 Cincinnati",
            "description": "Sunday is a 9 First Warning Weather Alert Day",
            "url": "https://www.wcpo.com/weather/weather-101/what-you-need-to-know-about-sundays-severe-weather-threat",
            "urlToImage": "https://ewscripps.brightspotcdn.com/dims4/default/1b578a2/2147483647/strip/true/crop/1920x1008+0+36/resize/1200x630!/quality/90/?url=http%3A%2F%2Fewscripps-brightspot.s3.amazonaws.com%2F7a%2Fa3%2F70bdd5c640b09dff78745b42209c%2F8p.jpg",
            "publishedAt": "2023-06-25T02:17:00Z",
            "content": "CINCINNATI Sunday is a 9 First Warning Weather Alert Day as we are tracking the potential for strong and severe thunderstorms.\r\nA strong low-pressure system, already responsible for tornadoes in the … [+6237 chars]"
        },
        {
            "source": {
                "id": null,
                "name": "SciTechDaily"
            },
            "author": null,
            "title": "Fusion, Recoil, Discovery: A New Type of Atomic Nucleus Discovered - SciTechDaily",
            "description": "In a remarkable scientific breakthrough researchers have discovered the lightest isotope of the rare and rapidly decaying element, astatine. The discovery of 190-Astatine was made by Master of Science graduate Henna Kokkonen as part of her thesis work, provid…",
            "url": "https://scitechdaily.com/fusion-recoil-discovery-a-new-type-of-atomic-nucleus-discovered/",
            "urlToImage": "https://scitechdaily.com/images/Atomic-Nucleus-Art-Concept.jpg",
            "publishedAt": "2023-06-25T01:30:26Z",
            "content": "Researchers at the Accelerator Laboratory of the University of Jyväskylä, Finland, have made a groundbreaking discovery of a new atomic nucleus, 190-Astatine, which is now the lightest known isotope … [+3083 chars]"
        },
        {
            "source": {
                "id": null,
                "name": "Oneesports.gg"
            },
            "author": "Nigel \"Zim947\" Zalamea",
            "title": "Deadlock abilities explained: How to weave chaos using Valorant's new web mechanics - ONE Esports",
            "description": "Deadlock abilities will give teams the advantage on defense. She can concuss, trap, block, and eliminate enemies with her kit.",
            "url": "https://www.oneesports.gg/valorant/deadlock-abilities-explained/",
            "urlToImage": "https://cdn.oneesports.gg/cdn-data/2023/06/Valorant_Deadlock_KeyArt.jpg",
            "publishedAt": "2023-06-25T00:32:31Z",
            "content": "A new hunter has joined the Valorant battlefield.\r\nThese Deadlock abilities are a game-changer that will force her opponents to change their approach when attacking sites and pushing on defense.\r\nDea… [+2646 chars]"
        },
        {
            "source": {
                "id": "the-wall-street-journal",
                "name": "The Wall Street Journal"
            },
            "author": "Alan Cullison",
            "title": "U.S. Tells Embassies to Keep Mum - The Wall Street Journal",
            "description": "Yevgeny Prigozhin, the owner of the Wagner paramilitary group, said his forces stopped their march on Moscow and returned to their camps to avoid bloodshed.",
            "url": "https://www.wsj.com/livecoverage/russia-wagner-prigozhin-putin",
            "urlToImage": "https://images.wsj.net/im-806384/social",
            "publishedAt": "2023-06-24T22:39:00Z",
            "content": "The State Department has given firm instructions to its embassies overseas to keep mum about events now unfolding in Russia, and that the U.S. government has no intention of getting involved.\r\nIn a m… [+557 chars]"
        },
        {
            "source": {
                "id": null,
                "name": "SheFinds"
            },
            "author": "Faith Geiger",
            "title": "The Supplement That May Lead To Liver Damage And Other Risks, Experts Warn - Yahoo Life",
            "description": "Adding supplements to your routine can be a great way to fill in any nutrient gaps in your diet and support a number of functions, from digestion to...",
            "url": "https://www.shefinds.com/collections/niacin-liver-damage/",
            "urlToImage": "https://media.zenfs.com/en/shefinds_255/95e339d27969ef0b17f7c1c54e240fe6",
            "publishedAt": "2023-06-24T22:30:37Z",
            "content": "bottles of vitamins on store shelves\r\nAdding supplements to your routine can be a great way to fill in any nutrient gaps in your diet and support a number of functions, from digestion to metabolism. … [+2640 chars]"
        },
        {
            "source": {
                "id": null,
                "name": "YourTango"
            },
            "author": "Ruby Miranda",
            "title": "The Weekly Tarot Horoscope For June 26 - July 2 Is Here For All Zodiac Signs - YourTango",
            "description": "The weekly tarot horoscope for June 26 to July 2, 2023 brings an easy going week for all zodiac signs. Here is why.",
            "url": "https://www.yourtango.com/2023363401/weekly-tarot-horoscope-june-26-july-2-2023-zodiac-signs",
            "urlToImage": "https://www.yourtango.com/sites/default/files/styles/listing_big/public/image_blog/weekly-tarot-horoscope-june-26-july-2-2023.png?itok=Lnme7weI",
            "publishedAt": "2023-06-24T22:10:12Z",
            "content": "Welcome to the Tarot reading for June 26 through July 2, 2023. Once again, we are crossing the monthly threshold, and in the Summertime, that always feels like something will happen. Will we finally … [+7691 chars]"
        },
        {
            "source": {
                "id": "abc-news",
                "name": "ABC News"
            },
            "author": "Fritz Farrow",
            "title": "Harris, Pence continue to differ one year after Dobbs - ABC News",
            "description": "While Harris advocates for abortion access, Pence backs strict restrictions.",
            "url": "https://abcnews.go.com/Politics/harris-pence-continue-differ-year-after-dobbs/story?id=100357749",
            "urlToImage": "https://s.abcnews.com/images/Politics/kamala-harris-ss-jt-230624_1687640994653_hpMain_16x9_992.jpg",
            "publishedAt": "2023-06-24T21:46:51Z",
            "content": "Vice President Kamala Harris assailed a spate of laws restricting abortion in states across the country one year after the Supreme Court overturned Roe v. Wade, as her predecessor openly embraces a f… [+3413 chars]"
        },
        {
            "source": {
                "id": null,
                "name": "Yahoo Entertainment"
            },
            "author": "DAVID HAMILTON",
            "title": "Ford Explorer recall prompts Transportation Department investigation - Yahoo News",
            "description": "The National Highway Traffic Safety Administration is investigating a Ford Motor Co. recall of more than a quarter-million Explorer SUVs in the U.S. after...",
            "url": "https://news.yahoo.com/ford-explorer-recall-prompts-transportation-213936679.html",
            "urlToImage": "https://s.yimg.com/ny/api/res/1.2/F477cq8fdXazl1vzDDJUOw--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD04MDA-/https://media.zenfs.com/en/ap.org/a1797abe3d01ce1d60e4db377c183005",
            "publishedAt": "2023-06-24T21:39:36Z",
            "content": "SAN FRANCISCO (AP) The National Highway Traffic Safety Administration is investigating a Ford Motor Co. recall of more than a quarter-million Explorer SUVs in the U.S. after receiving complaints abou… [+1291 chars]"
        }
    ]
}